# Element2D

Representation of element2D

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.element2_d import Element2D

# TODO update the JSON string below
json = "{}"
# create an instance of Element2D from a JSON string
element2_d_instance = Element2D.from_json(json)
# print the JSON string representation of the object
print(Element2D.to_json())

# convert the object into a dict
element2_d_dict = element2_d_instance.to_dict()
# create an instance of Element2D from a dict
element2_d_from_dict = Element2D.from_dict(element2_d_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)